app/views/teams/show.html.erb

    <ul class="side-nav">
      <% @team.players.each do |player| %>
---
SELECT "players".* FROM "players" WHERE "players"."team_id" = $1  [["team_id", 1]]

  <div class="medium-6 columns pictures">
    <% @team.pictures.each do |pic| %>
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."team_id" = $1  [["team_id", 4]]

  <div class="medium-6 columns videos">
    <% @team.videos.each do |vid| %>
---
SELECT  "videos".* FROM "videos" WHERE "videos"."team_id" = $1  ORDER BY "videos"."id" ASC LIMIT 1  [["team_id", 3]]