app/views/videos/_form.html.erb

    <%= f.label "Select your team:" %></br>
 <%=  f.collection_select(:team_id, Team.all, :id, :username ) %>
---
SELECT "teams".* FROM "teams"