app/views/pictures/_form.html.erb

SELECT "teams".* FROM "teams"
---
<div class="field">
 <%=  f.collection_select(:team_id, Team.all, :id, :username ) %>