app/views/players/_form.html.erb

    <%= f.label "Your team:" %><br>
     <%=  f.collection_select(:team_id, Team.all, :id, :username ) %>
---
SELECT "teams".* FROM "teams"