app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def index
    @pictures = Picture.all

INSERT INTO "pictures" ("team_id", "title", "post_images", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["team_id", 1], ["title", "Uni Champions!"], ["post_images", "wessex1.jpg"], ["created_at", "2015-11-06 06:21:35.135237"], ["updated_at", "2015-11-06 06:21:35.135237"]]
---
  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save

DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 5]]
---
  def destroy
    @picture.destroy

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 11]]
---
    def set_picture
      @picture = Picture.find(params[:id])