app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT "players".* FROM "players"

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("name", "position", "image", "team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Nye Jones"], ["position", "Midfield"], ["image", ""], ["team_id", 4], ["created_at", "2015-11-02 16:46:15.095348"], ["updated_at", "2015-11-02 16:46:15.095348"]]

  def update
    respond_to do |format|
      if @player.update(player_params)
---
UPDATE "players" SET "name" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["name", "Max Springall"], ["updated_at", "2015-11-06 06:05:23.510186"], ["id", 4]]

  def destroy
    @player.destroy
---
DELETE FROM "players" WHERE "players"."id" = $1  [["id", 8]]

    def set_player
      @player = Player.find(params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT 1  [["id", 8]]