app/controllers/teams_controller.rb

  def index
    @teams = Team.where("post_code ILIKE ?", "%#{params[:q]}%")
---
SELECT  "teams".* FROM "teams" WHERE "teams"."post_code" = $1 LIMIT 1  [["post_code", 39100]]

  def update
    respond_to do |format|
      if @team.update(team_params)
---
UPDATE "teams" SET "first_name" = $1, "last_name" = $2, "team_images" = $3, "updated_at" = $4 WHERE "teams"."id" = $5  [["first_name", "Gows"], ["last_name", "K"], ["team_images", "images.jpeg"], ["updated_at", "2015-11-06 07:19:29.588858"], ["id", 5]]

    def set_team
      @team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1  ORDER BY "teams"."id" ASC LIMIT 1  [["id", 4]]