app/controllers/videos_controller.rb

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO "videos" ("team_id", "title", "caption", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["team_id", 2], ["title", "Awesome goals"], ["caption", "^^NOT!"], ["image", "3UwfUzyTBZA"], ["created_at", "2015-11-02 19:14:28.670400"], ["updated_at", "2015-11-02 19:14:28.670400"]]

  def update
    respond_to do |format|
      if @video.update(video_params)
---
UPDATE "videos" SET "team_id" = $1, "updated_at" = $2 WHERE "videos"."id" = $3  [["team_id", 4], ["updated_at", "2015-11-02 19:22:19.623838"], ["id", 1]]

  def destroy
    @video.destroy
---
DELETE FROM "videos" WHERE "videos"."id" = $1  [["id", 1]]

    def set_video
      @video = Video.find(params[:id])
---
SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT 1  [["id", 1]]